In [1]:
#Q1. Five FUn of Pandas Library with Execution.

In [2]:
#Five Fun is 
# a. read_csv()
# b. df.head()
# c. df.tail()
# d. column ()
# e. len(df)

In [3]:
# Execution of Data Ex.

In [4]:
data={'animal' : ['alligator' ,'bee' ,'falcon' ,'lion' ,'monkey' 'parrot' ,'shark' ,'whale' 'zebra']}

In [5]:
import pandas as pd

In [6]:
data

{'animal': ['alligator',
  'bee',
  'falcon',
  'lion',
  'monkeyparrot',
  'shark',
  'whalezebra']}

In [7]:
df=pd.DataFrame({'animal' : ['alligator' ,'bee' ,'falcon' ,'lion' ,'monkey' 'parrot' ,'shark' ,'whale' 'zebra']})

In [8]:
df

         animal
0     alligator
1           bee
2        falcon
3          lion
4  monkeyparrot
5         shark
6    whalezebra

In [9]:
df.head()

         animal
0     alligator
1           bee
2        falcon
3          lion
4  monkeyparrot

In [10]:
df.tail()

         animal
2        falcon
3          lion
4  monkeyparrot
5         shark
6    whalezebra

In [11]:
len(df)

7

In [12]:
#Q2. Pandas DataFrame df which Columns 'A' , 'B' and 'c'

In [13]:
data={'A': ['Mohan','Sohan' ,'Rohit'] , 'B':['Ram' ,'Shyam','Mohan'] ,'C':['Mohan','Sohan','Rohit']}

In [14]:
data

{'A': ['Mohan', 'Sohan', 'Rohit'],
 'B': ['Ram', 'Shyam', 'Mohan'],
 'C': ['Mohan', 'Sohan', 'Rohit']}

In [15]:
pd.DataFrame({'A': ['Mohan','Sohan' ,'Rohit'] , 'B':['Ram' ,'Shyam','Mohan'] ,'C':['Mohan','Sohan','Rohit']})

       A      B      C
0  Mohan    Ram  Mohan
1  Sohan  Shyam  Sohan
2  Rohit  Mohan  Rohit

In [16]:
df=pd.DataFrame({'A': ['Mohan','Sohan' ,'Rohit'] , 'B':['Ram' ,'Shyam','Mohan'] ,'C':['Mohan','Sohan','Rohit']})

In [17]:
new_index=[1,2,3]

In [18]:
df.reindex(new_index)

       A      B      C
1  Sohan  Shyam  Sohan
2  Rohit  Mohan  Rohit
3    NaN    NaN    NaN

In [19]:
#Q3. df=[10,20,30,40,50] print sum of first three value which is 60

In [20]:
df=[10,20,30,40,50]

In [21]:
pd.DataFrame([10,20,30,40,50])

    0
0  10
1  20
2  30
3  40
4  50

In [28]:
df

[10, 20, 30, 40, 50]

In [29]:
sum=sum(df)

In [30]:
sum

150

In [34]:
df1=df[0:3]

In [36]:
df1

[10, 20, 30]

In [39]:
# Q5. How are DataFrame.size() and DataFrame.shape() diffrent?

In [40]:
#DataFrame.size()- the size property is used to get an int representing the number
#of element in this object and Return the number of rows if Series. Otherwise ,Return
#the number of rows times the number of columns if DataFrame.

#DataFrame.shape -the shape properties is used to get a tuple representing the dimensionality
#of the Pandas DataFrame.

In [42]:
#Q6 Which Fun of Pandas do we use to read an excel file?

# Ans is read_Excel()

In [43]:
#Q8. df=[['A':3,8,6,2,9] ,['B':5,2,9,3,1] ,['C' : 1,7,4,5,2]]
#select all rows where the value in column A >5 and value is column B <10

In [46]:
df={'A':[3,8,6,2,9] ,'B':[5,2,9,3,1] ,'C' : [1,7,4,5,2]}

In [47]:
pd.DataFrame(df)

   A  B  C
0  3  5  1
1  8  2  7
2  6  9  4
3  2  3  5
4  9  1  2

In [ ]:
df['A'>5